Revit 2027 API
BuiltInFailures.ImportFailures.LevelRenamedOnImport Property
 This level has been renamed from [SourceLevelName] to avoid duplication.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LevelRenamedOnImport { get; }
Public Shared ReadOnly Property LevelRenamedOnImport As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LevelRenamedOnImport {
	FailureDefinitionId^ get ();
}
static member LevelRenamedOnImport : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace